#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>
#include <string.h>

//①右移操作符
//>>
//符号不变，所以是算术右移
//相当于/2
//-1原码
//1000 0000 0000 0000 0000 0000 0000 0001原码
//1111 1111 1111 1111 1111 1111 1111 1110反码
//1111 1111 1111 1111 1111 1111 1111 1111补码（反码+1）
//int main()
//{
//	int a = -16;
//	int b = a >> 1;
//	printf("%d\n", b);
//	return 0;
//}

//②左移
//左边丢弃
//右边补零
//符号位不变
//算术左移
int main()
{
	int a= -5;
	int b = a << 1;
	printf("%d\n", b);

	return 0;
}

//注意：不能移负位

//③&按位与
//|按位或
//^按位异或 0 0->0,1 1->0,1 0->1,0 1->1(相同为0，相异为1)
//内存中补码存储
int main()
{
	int a = 5;
	int b = 3;
	b = a ^ b;
	a = a ^ b;
	b = a ^ b;
	printf("a:%d,b:%d", a, b);
	return 0;
}

//④求一个数转换为二进制含1的个数
int main()
{
	int a = 0;
	int count = 0;
	scanf("%d", &a);
	while (a)
	{
		if (a % 2 == 1)
			count++;
		a = a / 2;
	}
	printf("%d\n", count);
	return 0;
}

//利用按位与求含1个数
int main()
{
	int a = -1;
	int i = 0;
	int count = 0;
	for (i = 0; i < 32; i++)
	{
		if (1 == ((a >> i) & 1))
			count++;
	}
	printf("%d\n", count);
	return 0;
}

//赋值操作符

//复合操作符

//单目操作符
//!x 真变假，假变真
//&取地址
//*p解引用操作符
//sizeof所占字节
// ~按位取反
int main()
{
	int a = 15;
	a = a & (~(1 << 2));
	//0000 0000 0000 0000 0000 0000 0000 0001 数字1
	//0000 0000 0000 0000 0000 0000 0000 0100 1<<2
	//1111 1111 1111 1111 1111 1111 1111 1011 补码(~(1 << 2))
	//0000 0000 0000 0000 0000 0000 0000 1111 15
	//a&(1<<2)
	//0000 0000 0000 0000 0000 0000 0000 0100 4
	//a & (~(1 << 2))
	//0000 0000 0000 0000 0000 0000 0000 1011 11
	printf("%d\n", a);
	return 0;
}

// &&当第一个为假，后面表达式不运行

// ||第一个为真后面的不运行

struct Stu
{
	char name[20];
	int age;

};
int main()
{
	struct Stu s1={"张三"};
	struct Stu* sp = &s1;
	//整数可以直接修改
	s1.age = 20;
	//字符串需要引用字符串库里的函数进行对其修改
	strcpy(s1.name, "李四");//修改结构体的字符串内容
	//s1.name =  "zhangsan" ;//不可行
	printf("%d\n", s1.age);//结构成员访问，结构体本身
	printf("%s\n", sp->name);//结构成员访问，结构体指针
	return 0;
}

//目的：求表达式的值